STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.c
/**
  ******************************************************************************
  * @file    stm32g474e_eval.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage
  *          LEDs
  *          Push-buttons
  *          Joystick
  *          POTentiometer
  *          COM ports
  *          available on STM32G474E-EVAL board (MB1397) from STMicroelectronics.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32g474e_eval.h"

#if (USE_BSP_COM_FEATURE > 0)
  #if (USE_COM_LOG > 0)
    #ifndef __GNUC__
      #include <stdio.h>
    #endif
  #endif
#endif

/** @addtogroup BSP
  * @{
  */

/** @defgroup STM32G474E-EVAL STM32G474E-EVAL
  * @{
  */

/** @defgroup STM32G474E-EVAL_Common STM32G474E-EVAL Common
  * @brief This file provides set of firmware functions to manage Leds and push-button
  *        available on STM32G474E-EVAL Kit from STMicroelectronics.
  * @{
  */

/** @defgroup STM32G474E-EVAL_Private_TypesDefinitions Private Types Definitions 
  * @{
  */
typedef void (* BSP_EXTI_LineCallback) (void);
/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_Private_Variables Private Variables
  * @{
  */
static GPIO_TypeDef* LED_PORT[LEDn] = {LED1_GPIO_PORT,
                                       0,
                                       LED3_GPIO_PORT,
                                       0,
                                       LED_BUCK_GPIO_PORT};
#if (USE_BSP_IO_CLASS > 0)
static const uint32_t LED_PIN[LEDn] = {LED1_PIN,
                                       LED2_PIN,
                                       LED3_PIN,
                                       LED4_PIN,
                                       LED_BUCK_PIN};
#else
static const uint32_t LED_PIN[LEDn] = {LED1_PIN,
                                       0,
                                       LED3_PIN,
                                       0,
                                       LED_BUCK_PIN};
#endif /* (USE_BSP_IO_CLASS > 0) */
static GPIO_TypeDef* BUTTON_PORT[BUTTONn] = {USER_BUTTON_GPIO_PORT};
static const uint16_t BUTTON_PIN[BUTTONn] = {USER_BUTTON_PIN};
static const IRQn_Type BUTTON_IRQn[BUTTONn] = {USER_BUTTON_EXTI_IRQn};

#if (USE_BSP_COM_FEATURE > 0)
static USART_TypeDef* COM_USART[COMn]   = {COM1_UART};
#if (USE_COM_LOG > 0)
static COM_TypeDef COM_ActiveLogPort = COM1;
#endif
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
static uint32_t IsComMspCbValid[COMn] = {0};
#endif
#endif /* (USE_BSP_COM_FEATURE > 0)*/

#if (USE_BSP_POT_FEATURE > 0)
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1) || (USE_HAL_COMP_REGISTER_CALLBACKS == 1) || (USE_HAL_OPAMP_REGISTER_CALLBACKS == 1)
static uint32_t IsPotMspCbValid[POTn] = {0};
#endif  /* USE_HAL_XXX_REGISTER_CALLBACKS */
#endif  /* (USE_BSP_POT_FEATURE > 0) */

#if (USE_BSP_IO_CLASS > 0)
#if (USE_BSP_JOY_FEATURE > 0)
static uint16_t CurrentJoyPins[JOYn]  = {0};
static uint32_t JoyPinsMask[JOYn];

static const uint16_t JOY_NONE_PIN[JOYn]  = {JOY_NONE};
static const uint16_t JOY_SEL_PIN[JOYn]   = {JOY_SEL};
static const uint16_t JOY_DOWN_PIN[JOYn]  = {JOY_DOWN};
static const uint16_t JOY_LEFT_PIN[JOYn]  = {JOY_LEFT};
static const uint16_t JOY_RIGHT_PIN[JOYn] = {JOY_RIGHT};
static const uint16_t JOY_UP_PIN[JOYn]    = {JOY_UP};
static const uint16_t JOY_ALL_PIN[JOYn]   = {JOY_ALL};
#endif /* USE_BSP_JOY_FEATURE */
#endif /* USE_BSP_IO_CLASS */

#if defined(_GUI_INTERFACE)
const uint8_t HWBoardVersionName[]  = "STM32G474E-EVAL";
const uint8_t PDTypeName[]          = "MB1397B";
#endif /* _GUI_INTERFACE */

/**
  * @}
  */

/** @defgroup STM32G474E-EVAL_Exported_Variables Exported Variables
  * @{
  */

#if (USE_BSP_IO_CLASS > 0)
#if (USE_BSP_JOY_FEATURE > 0)
EXTI_HandleTypeDef hjoy_exti[JOYn];
#endif /* USE_BSP_JOY_FEATURE */
#endif /* USE_BSP_IO_CLASS */
#if (USE_BSP_COM_FEATURE > 0)
UART_HandleTypeDef hcom_uart[COMn];
#endif /* USE_BSP_COM_FEATURE */
EXTI_HandleTypeDef hpb_exti[BUTTONn];

#if (USE_BSP_POT_FEATURE > 0)
OPAMP_HandleTypeDef hpot_opamp[POTn];
ADC_HandleTypeDef hpot_adc[POTn];
#if (USE_BSP_POT_COMP_FEATURE > 0)
COMP_HandleTypeDef hpot_comp[POTn];
#endif /* (USE_BSP_POT_COMP_FEATURE > 0)*/
#endif  /* (USE_BSP_POT_FEATURE > 0) */
/**
  * @}
  */

/** STM32G474E-EVAL_Private_FunctionPrototypes Private Functions Prototypes
  */

#if (USE_BSP_POT_FEATURE > 0)
static void OPAMP4_MspInit(OPAMP_HandleTypeDef *hopamp);
static void OPAMP4_MspDeInit(OPAMP_HandleTypeDef *hopamp);
static void ADC5_MspInit(ADC_HandleTypeDef *hadc);
static void ADC5_MspDeInit(ADC_HandleTypeDef *hadc);
#if (USE_BSP_POT_COMP_FEATURE > 0)
static void COMP6_MspInit(COMP_HandleTypeDef *hcomp);
static void COMP6_MspDeInit(COMP_HandleTypeDef *hcomp);
#endif  /* (USE_BSP_POT_COMP_FEATURE > 0) */
#endif  /* (USE_BSP_POT_FEATURE > 0) */

#if (USE_BSP_COM_FEATURE > 0)
static void USART1_MspInit(UART_HandleTypeDef *huart);
static void USART1_MspDeInit(UART_HandleTypeDef *huart);
#endif

#if (USE_BSP_IO_CLASS > 0)
#if (USE_BSP_JOY_FEATURE > 0)
static void JOY1_EXTI_Callback(void);
#endif /* USE_BSP_JOY_FEATURE */
#endif /* USE_BSP_IO_CLASS */

static void BUTTON_USER_EXTI_Callback(void);
/**
  */

/** @defgroup STM32G474E-EVAL_Exported_Functions Exported Functions
  * @{
  */

  /**
  * @brief  This method returns the STM32G474E-EVAL BSP Driver revision
  * @retval version: 0xXYZR (8bits for each decimal, R for RC)
  */
int32_t BSP_GetVersion(void)
{
  return (int32_t)STM32G474E_EVAL_BSP_VERSION;
}

#if defined(_GUI_INTERFACE)
/**
  * @brief  This method returns HW board version name
  * @retval HW Board version name
  */
const uint8_t* BSP_GetHWBoardVersionName(void)
{
  return HWBoardVersionName;
}

/**
  * @brief  This method returns HW PD Type name
  * @retval HW Board version name
  */
const uint8_t* BSP_GetPDTypeName(void)
{
  return PDTypeName;
}

#endif /* _GUI_INTERFACE */
/**
  * @brief  Configures LED on GPIO.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED_BUCK
  * @retval BSP status
  */
int32_t BSP_LED_Init(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t io_init_structure;
#endif /* USE_BSP_IO_CLASS */
  GPIO_InitTypeDef  gpio_init_structure;

  if((Led == LED1) || (Led == LED3) || (Led == LED_BUCK))
  {
    /* Enable the GPIO_LED clock */
    if(Led == LED1)
    {
      LED1_GPIO_CLK_ENABLE();
    }
    else if(Led == LED3)
    {
      LED3_GPIO_CLK_ENABLE();
    }
    else
    {
      LED_BUCK_GPIO_CLK_ENABLE();
    }

   /* Configure the GPIO_LED pin */
   gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
   gpio_init_structure.Pull = GPIO_PULLUP;
   gpio_init_structure.Speed = GPIO_SPEED_FREQ_LOW;
   gpio_init_structure.Pin = LED_PIN [Led];
   HAL_GPIO_Init(LED_PORT [Led], &gpio_init_structure);
   HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_PIN_SET);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   io_init_structure.Pin  = LED_PIN[Led];
   io_init_structure.Pull = IO_NOPULL;
   io_init_structure.Mode = IO_MODE_OUTPUT_PP;
   /* Initialize MFX */
   if(BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
   {
    ret = BSP_ERROR_NO_INIT;
   }
   else
   {
     if(BSP_IO_WritePin(0, (uint16_t)LED_PIN[Led], IO_PIN_SET) != BSP_ERROR_NONE)
     {
      ret = BSP_ERROR_NO_INIT;
     }
   }
#endif /* USE_BSP_IO_CLASS */
  }

  return ret;
}

/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  *            @arg  LED_BUCK
  * @retval BSP status
  */
int32_t BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
#if (USE_BSP_IO_CLASS > 0)
  BSP_IO_Init_t io_init_structure;
#endif /* USE_BSP_IO_CLASS */
  GPIO_InitTypeDef  gpio_init_structure;

  if((Led == LED1) || (Led == LED3) || (Led == LED_BUCK))
  {
   /* Configure the GPIO_LED pin */
   gpio_init_structure.Pin = LED_PIN [Led];
   HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_PIN_SET);

   HAL_GPIO_DeInit(LED_PORT [Led], gpio_init_structure.Pin);
  }
  else
  {
#if (USE_BSP_IO_CLASS > 0)
   if(BSP_IO_WritePin(0, (uint16_t)LED_PIN[Led], IO_PIN_RESET) != BSP_ERROR_NONE)
   {
     ret = BSP_ERROR_NO_INIT;
   }
   else
   {
    io_init_structure.Pin  = LED_PIN[Led];
    io_init_structure.Pull = IO_PULLUP;
    io_init_structure.Mode = IO_MODE_OFF;

