STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.c
    if(HAL_UART_DeInit(&hcom_uart[COM]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
  * @brief  Configures COM port.
  * @param  huart USART handle
  * @param  Init Pointer to a UART_HandleTypeDef structure that contains the
  *                  configuration information for the specified USART peripheral.
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_USART1_Init(UART_HandleTypeDef *huart, MX_UART_InitTypeDef *Init)
{
  /* USART configuration */
  huart->Init.BaudRate     = Init->BaudRate;
  huart->Init.Mode         = UART_MODE_TX_RX;
  huart->Init.Parity       = (uint32_t)Init->Parity;
  huart->Init.WordLength   = Init->WordLength;
  huart->Init.StopBits     = (uint32_t)Init->StopBits;
  huart->Init.HwFlowCtl    = (uint32_t)Init->HwFlowCtl;
  huart->Init.OverSampling = UART_OVERSAMPLING_8;

  return HAL_UART_Init(huart);
}

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
/**
  * @brief Register Default COM Msp Callbacks
  * @param  COM COM port to be configured.
  * @retval BSP status
  */
int32_t BSP_COM_RegisterDefaultMspCallbacks(COM_TypeDef COM)
{
  int32_t ret = BSP_ERROR_NONE;

  if(COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register default MspInit/MspDeInit Callback */
    if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, USART1_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, USART1_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}

/**
  * @brief  Register COM1 Msp Callback registering
  * @param  COM COM port to be configured.
  * @param  Callbacks     pointer to COM MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_COM_RegisterMspCallbacks(COM_TypeDef COM, BSP_COM_Cb_t *Callback)
{
  int32_t ret = BSP_ERROR_NONE;

  if(COM >= COMn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    __HAL_UART_RESET_HANDLE_STATE(&hcom_uart[COM]);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPINIT_CB_ID, Callback->pMspInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_UART_RegisterCallback(&hcom_uart[COM], HAL_UART_MSPDEINIT_CB_ID, Callback->pMspDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsComMspCbValid[COM] = 1U;
    }
  }

  /* BSP status */
  return ret;
}
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

#if (USE_COM_LOG > 0)
/**
  * @brief  Select the active COM port.
  * @param  COM COM port to be activated.
  *          This parameter can be COM1
  * @retval BSP status
  */
int32_t BSP_COM_SelectLogPort(COM_TypeDef COM)
{
  if(COM_ActiveLogPort != COM)
  {
    COM_ActiveLogPort = COM;
  }
  return BSP_ERROR_NONE;
}

/**
  * @brief  Redirect console output to COM
  */
 #ifdef __GNUC__
 int __io_putchar (int ch)
{
 #else
 int fputc (int ch, FILE *f)
{
 UNUSED(f);
 #endif /* __GNUC__ */

  (void)HAL_UART_Transmit (&hcom_uart [COM_ActiveLogPort], (uint8_t *) &ch, 1, COM_POLL_TIMEOUT);
  return ch;
}
#endif /* USE_COM_LOG */
#endif /* USE_BSP_COM_FEATURE*/

#if (USE_BSP_POT_FEATURE > 0)
/**
  * @brief  Init Potentiometer.
  * @param  POT  Potentiometer to be activated.
  * @retval BSP status
  */
int32_t BSP_POT_Init(POT_TypeDef POT)
{
  int32_t ret;

  if(POT >= POTn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#if (USE_BSP_POT_COMP_FEATURE > 0)
    hpot_comp[POT].Instance           = COMP6;
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
    hpot_opamp[POT].Instance          = OPAMP4;
    hpot_adc[POT].Instance            = ADC5;
#if (USE_HAL_OPAMP_REGISTER_CALLBACKS == 0)
    OPAMP4_MspInit(&hpot_opamp[POT]);
#endif /* (USE_HAL_OPAMP_REGISTER_CALLBACKS == 0)*/
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
    /* Init the ADC Msp */
    ADC5_MspInit(&hpot_adc[POT]);
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0)*/
#if (USE_BSP_POT_COMP_FEATURE > 0)
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 0)
    COMP6_MspInit(&hpot_comp[POT]);
#endif /* (USE_HAL_COMP_REGISTER_CALLBACKS == 0)*/
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1) || (USE_HAL_COMP_REGISTER_CALLBACKS == 1) || (USE_HAL_OPAMP_REGISTER_CALLBACKS == 1)
    if(IsPotMspCbValid[POT] == 0U)
    {
      if(BSP_POT_RegisterDefaultMspCallbacks(POT) != BSP_ERROR_NONE)
      {
        ret = BSP_ERROR_MSP_FAILURE;
      }
    }
#endif /* USE_HAL_XXX_REGISTER_CALLBACKS */
    if(MX_OPAMP4_Init(&hpot_opamp[POT]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(MX_ADC5_Init(&hpot_adc[POT]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
#if (USE_BSP_POT_COMP_FEATURE > 0)
    else if(MX_COMP6_Init(&hpot_comp[POT]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  return ret;
}

/**
  * @brief  De-Initialize the Potentiometer.
  * @param  POT  Potentiometer to be activated.
  * @retval BSP status
  */
int32_t BSP_POT_DeInit(POT_TypeDef POT)
{
  int32_t ret;

  if(POT >= POTn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#if (USE_HAL_OPAMP_REGISTER_CALLBACKS == 0)
    OPAMP4_MspDeInit(&hpot_opamp[POT]);
#endif /* (USE_HAL_OPAMP_REGISTER_CALLBACKS == 0) */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 0)
    ADC5_MspDeInit(&hpot_adc[POT]);
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS == 0) */
#if (USE_BSP_POT_COMP_FEATURE > 0)
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 0)
    COMP6_MspDeInit(&hpot_comp[POT]);
#endif /* (USE_HAL_COMP_REGISTER_CALLBACKS == 0) */
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
    if(MX_OPAMP4_DeInit(&hpot_opamp[POT]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_ADC_DeInit(&hpot_adc[POT]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
#if (USE_BSP_POT_COMP_FEATURE > 0)
    else if(MX_COMP6_DeInit(&hpot_comp[POT]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
    else
    {
      ret = BSP_ERROR_NONE;
    }
  }

  return ret;
}

/**
  * @brief  Get Potentiometer level in 12 bits.
  * @retval Potentiometer level(0..100%) / 0xFFFFFFFF : Error
  */
int32_t BSP_POT_GetLevel(POT_TypeDef POT)
{
  int32_t ret = (int32_t)0xFFFFFFFFU;
  uint32_t AdcValue;

  if(POT >= POTn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (HAL_OPAMP_Start(&hpot_opamp[POT]) != HAL_OK)
  {
    ret =  BSP_ERROR_PERIPH_FAILURE;
  }
#if (USE_BSP_POT_COMP_FEATURE > 0)
  else if(HAL_COMP_Start(&hpot_comp[POT]) != HAL_OK)
  {
    ret =  BSP_ERROR_PERIPH_FAILURE;
  }
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
  else if(HAL_ADC_Start(&hpot_adc[POT]) != HAL_OK)
  {
    ret = BSP_ERROR_PERIPH_FAILURE;
  }
  else
  {
    if(HAL_ADC_PollForConversion(&hpot_adc[POT], POT_ADC_POLL_TIMEOUT) == HAL_OK)
    {
      AdcValue = HAL_ADC_GetValue(&hpot_adc[POT]);
      if(AdcValue <= 0x0FFFU)
      {
        ret = (int32_t)POT_CONVERT2PERC((uint32_t)AdcValue);
      }
    }
    else
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  return ret;
}

#if (USE_BSP_POT_COMP_FEATURE > 0)
/**
  * @brief  Configures Comp6 peripheral
  * @param  comp COMP handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_COMP6_Init(COMP_HandleTypeDef *hcomp)
{
  HAL_StatusTypeDef ret = HAL_OK;

  /* COMP configuration */
  hcomp->Init.InputPlus      = COMP_INPUT_PLUS_IO1;
  hcomp->Init.InputMinus     = COMP_INPUT_MINUS_1_2VREFINT; /* compare to half Vref */
  hcomp->Init.OutputPol      = COMP_OUTPUTPOL_NONINVERTED;
  hcomp->Init.BlankingSrce   = COMP_BLANKINGSRC_NONE;
  hcomp->Init.TriggerMode    = COMP_TRIGGERMODE_NONE;
  hcomp->Init.DeglitcherMode = COMP_DEGLITCHER_DISABLED;

  if (HAL_COMP_Init(hcomp) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }

  return ret;
}

/**
  * @brief  DeConfigures Comp6 peripheral
  * @param  comp COMP handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_COMP6_DeInit(COMP_HandleTypeDef *comp)
{
  HAL_StatusTypeDef ret = HAL_OK;

  if (HAL_COMP_Stop(comp) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }
  else
  {
    if (HAL_COMP_DeInit(comp) != HAL_OK)
    {
      ret =  HAL_ERROR;
    }
  }

  return ret;
}
#endif /* USE_BSP_POT_COMP_FEATURE > 0)*/

/**
  * @brief  Configures OpAmp4 peripheral
  * @param  opamp OPAMP handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_OPAMP4_Init(OPAMP_HandleTypeDef *opamp)
{
  HAL_StatusTypeDef ret = HAL_OK;

  /* COMP configuration */
  opamp->Init.InternalOutput    = ENABLE;
  opamp->Init.Mode              = OPAMP_FOLLOWER_MODE;
  opamp->Init.NonInvertingInput = OPAMP_NONINVERTINGINPUT_IO2;

  if (HAL_OPAMP_Init(opamp) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }

  return ret;
}

/**
  * @brief  DeConfigures OpAmp4 peripheral
  * @param  opamp OPAMP handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_OPAMP4_DeInit(OPAMP_HandleTypeDef *opamp)
{
  HAL_StatusTypeDef ret = HAL_OK;

  if (HAL_OPAMP_Stop(opamp) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }
  else
  {
    if (HAL_OPAMP_DeInit(opamp) != HAL_OK)
    {
      ret =  HAL_ERROR;
    }
  }

  return ret;
}

/**
  * @brief  Configures ADC5 peripheral
  * @param  hadc ADC handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_ADC5_Init(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef ret = HAL_OK;
  ADC_ChannelConfTypeDef sConfig = {0};

  /* ADC configuration */
  hadc->Init.ClockPrescaler        = POT1_PRESCALER;
  hadc->Init.Resolution            = ADC_RESOLUTION_12B;
  hadc->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
  hadc->Init.ScanConvMode          = (uint32_t)DISABLE;
#if defined(ADC_EOC_SINGLE_CONV)
  hadc->Init.EOCSelection          = ADC_EOC_SINGLE_CONV;
#endif
  hadc->Init.ContinuousConvMode    = DISABLE;
  hadc->Init.NbrOfConversion       = 1;
  hadc->Init.DiscontinuousConvMode = DISABLE;
  hadc->Init.NbrOfDiscConversion   = 0;
  hadc->Init.ExternalTrigConv      = ADC_SOFTWARE_START;
  hadc->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc->Init.DMAContinuousRequests = DISABLE;

  if (HAL_ADC_Init(hadc) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }
  else
  {
    /**Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
    */
    sConfig.Channel      = POT1_ADC_CHANNEL;
    sConfig.Rank         = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = POT1_SAMPLING_TIME;
    sConfig.Offset       = 0;
#if defined(ADC_SINGLE_ENDED)
    sConfig.SingleDiff   = ADC_SINGLE_ENDED;
#endif
#if defined(ADC_OFFSET_NONE)
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
#endif
    if (HAL_ADC_ConfigChannel(hadc, &sConfig) != HAL_OK)
    {
      ret =  HAL_ERROR;
    }
  }

  return ret;
}

/**
  * @brief  DeConfigures ADC5 peripheral
  * @param  hadc ADC handle
  * @retval HAL error code
  */
__weak HAL_StatusTypeDef MX_ADC5_DeInit(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef ret = HAL_OK;

  if (HAL_ADC_Stop(hadc) != HAL_OK)
  {
    ret =  HAL_ERROR;
  }
  else
  {
    if (HAL_ADC_DeInit(hadc) != HAL_OK)
    {
      ret =  HAL_ERROR;
    }
  }

  return ret;
}

#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1) || (USE_HAL_COMP_REGISTER_CALLBACKS == 1)  || (USE_HAL_OPAMP_REGISTER_CALLBACKS == 1)
/**
  * @brief Register Default Potentiometer Msp Callbacks
  * @param POT Potentiometer instance
  * @retval BSP status
  */
int32_t BSP_POT_RegisterDefaultMspCallbacks (POT_TypeDef POT)
{
  int32_t ret = BSP_ERROR_NONE;

  if(POT >= POTn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#if (USE_HAL_OPAMP_REGISTER_CALLBACKS == 1)
    /* Register default MspInit/MspDeInit Callback */
    if(HAL_OPAMP_RegisterCallback(&hpot_opamp[POT], HAL_OPAMP_MSP_INIT_CB_ID, OPAMP4_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_OPAMP_RegisterCallback(&hpot_opamp[POT], HAL_OPAMP_MSP_DEINIT_CB_ID, OPAMP4_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
#endif /*(USE_HAL_OPAMP_REGISTER_CALLBACKS == 1)*/
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    __HAL_ADC_RESET_HANDLE_STATE(&hpot_adc[POT]);

