STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.c
    /* Register default MspInit/MspDeInit Callback */
    if(HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPINIT_CB_ID, ADC5_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPDEINIT_CB_ID, ADC5_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
#endif /*(USE_HAL_ADC_REGISTER_CALLBACKS == 1)*/
#if (USE_BSP_POT_COMP_FEATURE > 0)
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
    /* Register default MspInit/MspDeInit Callback */
    if(HAL_COMP_RegisterCallback(&hpot_comp[POT], HAL_COMP_MSPINIT_CB_ID, COMP6_MspInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_COMP_RegisterCallback(&hpot_comp[POT], HAL_COMP_MSPDEINIT_CB_ID, COMP6_MspDeInit) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
#endif /*(USE_HAL_COMP_REGISTER_CALLBACKS == 1)*/
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
  }

  /* BSP status */
  return ret;
}

/**
  * @brief Register Potentiometer Msp Callback registering
  * @param POT Potentiometer instance
  * @param Callbacks     pointer to Potentiometer MspInit/MspDeInit callback functions
  * @retval BSP status
  */
int32_t BSP_POT_RegisterMspCallbacks (POT_TypeDef POT, BSP_POT_Cb_t *Callback)
{
  int32_t ret = BSP_ERROR_NONE;

  if(POT >= POTn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
#if (USE_HAL_OPAMP_REGISTER_CALLBACKS == 1)
    __HAL_OPAMP_RESET_HANDLE_STATE(&hpot_opamp [POT]);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_OPAMP_RegisterCallback(&hpot_opamp[POT], HAL_OPAMP_MSP_INIT_CB_ID, Callback->pMspOPAMPInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_OPAMP_RegisterCallback(&hpot_opamp[POT], HAL_OPAMP_MSP_DEINIT_CB_ID, Callback->pMspOPAMPDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
#endif /* (USE_HAL_OPAMP_REGISTER_CALLBACKS */
#if (USE_HAL_ADC_REGISTER_CALLBACKS == 1)
    __HAL_ADC_RESET_HANDLE_STATE(&hpot_adc[POT]);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPINIT_CB_ID, Callback->pMspADCInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_ADC_RegisterCallback(&hpot_adc[POT], HAL_ADC_MSPDEINIT_CB_ID, Callback->pMspADCDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
#endif /* (USE_HAL_ADC_REGISTER_CALLBACKS */
#if (USE_BSP_POT_COMP_FEATURE > 0)
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
    __HAL_COMP_RESET_HANDLE_STATE(&hpot_comp [POT]);

    /* Register MspInit/MspDeInit Callbacks */
    if(HAL_COMP_RegisterCallback(&hpot_comp[POT], HAL_COMP_MSPINIT_CB_ID, Callback->pMspCOMPInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else if(HAL_COMP_RegisterCallback(&hpot_comp[POT], HAL_COMP_MSPDEINIT_CB_ID, Callback->pMspCOMPDeInitCb) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      IsPotMspCbValid[POT] = 1U;
    }
#endif /* (USE_HAL_COMP_REGISTER_CALLBACKS */
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */
  }
  /* BSP status */
  return ret;
}
#endif /* USE_HAL_ADC_REGISTER_CALLBACKS */
#endif /*(USE_BSP_POT_FEATURE > 0)*/

#if (USE_BSP_IO_CLASS > 0 )
#if (USE_BSP_JOY_FEATURE > 0)
/**
  * @brief  Configures joystick GPIO and EXTI modes.
  * @param  JOY Joystick to be initialized
  * @param  JoyMode Button mode.
  *          This parameter can be one of the following values:
  *            @arg  JOY_MODE_GPIO: Joystick pins will be used as simple IOs
  *            @arg  JOY_MODE_EXTI: Joystick pins will be connected to EXTI line
  *                                 with interrupt generation capability
  * @param  JoyPins joystick pins to be initialized
  * @retval BSP status
  */
int32_t BSP_JOY_Init(JOY_TypeDef JOY, JOYMode_TypeDef JoyMode, JOYPin_TypeDef JoyPins)
{
  int32_t          ret;
  BSP_IO_Init_t    io_init_structure;
  static BSP_EXTI_LineCallback JoyCallback[JOYn] = {JOY1_EXTI_Callback};
  static const uint32_t JOY_EXTI_LINE[JOYn]   = {JOY1_EXTI_LINE};

  if(JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
         /* Initialize the BSP IO driver and configure the joystick pin */
         switch (JoyPins)
         {
           case JOY_SEL:
             io_init_structure.Pin = JOY_SEL_PIN[JOY];
             CurrentJoyPins[JOY] |= JOY_SEL_PIN[JOY];
             break;
           case JOY_DOWN:
             io_init_structure.Pin = JOY_DOWN_PIN[JOY];
             CurrentJoyPins[JOY] |= JOY_DOWN_PIN[JOY];
             break;
           case JOY_LEFT:
             io_init_structure.Pin = JOY_LEFT_PIN[JOY];
             CurrentJoyPins[JOY] |= JOY_LEFT_PIN[JOY];
             break;
           case JOY_RIGHT:
             io_init_structure.Pin = JOY_RIGHT_PIN[JOY];
             CurrentJoyPins[JOY] |= JOY_RIGHT_PIN[JOY];
             break;
           case JOY_UP:
             io_init_structure.Pin = JOY_UP_PIN[JOY];
             CurrentJoyPins[JOY] |= JOY_UP_PIN[JOY];
             break;
           case JOY_ALL:
             io_init_structure.Pin = JOY_ALL_PIN[JOY];
             CurrentJoyPins[JOY] |= JOY_ALL_PIN[JOY];
             break;
           default :
             CurrentJoyPins[JOY] |= JOY_NONE_PIN[JOY];
             break;
         }
         JoyPinsMask[JOY] |= io_init_structure.Pin;
         io_init_structure.Mode = (JoyMode == JOY_MODE_GPIO) ? IO_MODE_INPUT : IO_MODE_IT_LOW_LEVEL;
         io_init_structure.Pull = IO_PULLUP;
         ret = BSP_IO_Init(0, &io_init_structure);
         if ((ret == BSP_ERROR_NONE) && (JoyMode == JOY_MODE_EXTI))
         {
           /* Interrupt already enabled on BSP_IO_Init, just register callback */
           if (HAL_EXTI_GetHandle(&hjoy_exti[JOY], JOY_EXTI_LINE[JOY]) == HAL_OK)
           {
             if (HAL_EXTI_RegisterCallback(&hjoy_exti[JOY], HAL_EXTI_COMMON_CB_ID, JoyCallback[JOY]) != HAL_OK)
             {
               ret = BSP_ERROR_PERIPH_FAILURE;
             }
           }
           else
           {
             ret = BSP_ERROR_PERIPH_FAILURE;
           }
         }
  }
  return ret;
}

/**
  * @brief  DeInit joystick GPIOs.
  * @note   JOY DeInit does not disable the MFX, just set the MFX pins in Off mode
  * @param  JOY Joystick to be de-initialized
  * @param  JoyPins joystick pins to be de-initialized
  * @retval BSP status
  */
int32_t BSP_JOY_DeInit(JOY_TypeDef JOY, JOYPin_TypeDef JoyPins)
{
  int32_t ret = BSP_ERROR_NONE;
  BSP_IO_Init_t io_init_structure;

  if(JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
        switch (JoyPins)
        {
         case JOY_SEL:
          io_init_structure.Pin = JOY_SEL_PIN[JOY];
          CurrentJoyPins[JOY] &= ~(JOY_SEL_PIN[JOY]);
          break;
         case JOY_DOWN:
          io_init_structure.Pin = JOY_DOWN_PIN[JOY];
          CurrentJoyPins[JOY] &= ~(JOY_DOWN_PIN[JOY]);
          break;
         case JOY_LEFT:
          io_init_structure.Pin = JOY_LEFT_PIN[JOY];
          CurrentJoyPins[JOY] &= ~(JOY_LEFT_PIN[JOY]);
          break;
         case JOY_RIGHT:
          io_init_structure.Pin = JOY_RIGHT_PIN[JOY];
          CurrentJoyPins[JOY] &= ~(JOY_RIGHT_PIN[JOY]);
          break;
         case JOY_UP:
          io_init_structure.Pin = JOY_UP_PIN[JOY];
          CurrentJoyPins[JOY] &= ~(JOY_UP_PIN[JOY]);
          break;
         case JOY_ALL:
          io_init_structure.Pin = JOY_ALL_PIN[JOY];
          CurrentJoyPins[JOY] &= ~(JOY_ALL_PIN[JOY]);
          break;
         default :
          CurrentJoyPins[JOY] &= ~(JOY_NONE_PIN[JOY]);
          break;
        }

        io_init_structure.Pull = IO_PULLUP;
        io_init_structure.Mode = IO_MODE_OFF;
        JoyPinsMask[JOY] &= ~io_init_structure.Pin;

