STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.c
        if(BSP_IO_Init(0, &io_init_structure) != BSP_ERROR_NONE)
        {
          ret = BSP_ERROR_BUS_FAILURE;
        }
  }
  return ret;
}

/**
  * @brief  Returns the current joystick status.
  * @param  JOY Joystick instance
  * @retval Code of the joystick key pressed
  *          This code can be one of the following values:
  *            @arg  JOY1_NONE
  *            @arg  JOY1_SEL
  *            @arg  JOY1_DOWN
  *            @arg  JOY1_LEFT
  *            @arg  JOY1_RIGHT
  *            @arg  JOY1_UP
  */
int32_t BSP_JOY_GetState(JOY_TypeDef JOY)
{
  int32_t ret = BSP_ERROR_NONE;
  int32_t status;

  if(JOY >= JOYn)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
      if ((CurrentJoyPins[JOY] & JOY_SEL_PIN[JOY]) == JOY_SEL_PIN[JOY])
      {
        /* Read status of JOY_SEL */
        status = BSP_IO_ReadPin(0, JOY_SEL_PIN[JOY]);
        if (status >= 0)
        {
          ret = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_SEL : (int32_t)JOY_NONE;
        }
        else
        {
          ret = status;
        }
      }
      if (((CurrentJoyPins[JOY] & JOY_UP_PIN[JOY]) == JOY_UP_PIN[JOY]) && (ret == (int32_t)JOY_NONE))
      {
        /* Read status of JOY_UP */
        status = BSP_IO_ReadPin(0, JOY_UP_PIN[JOY]);
        if (status >= 0)
        {
          ret = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_UP : (int32_t)JOY_NONE;
        }
        else
        {
          ret = status;
        }
      }
      if (((CurrentJoyPins[JOY] & JOY_DOWN_PIN[JOY]) == JOY_DOWN_PIN[JOY]) && (ret == (int32_t)JOY_NONE))
      {
        /* Read status of JOY_DOWN */
        status = BSP_IO_ReadPin(0, JOY_DOWN_PIN[JOY]);
        if (status >= 0)
        {
          ret = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_DOWN : (int32_t)JOY_NONE;
        }
        else
        {
          ret = status;
        }
      }
      if (((CurrentJoyPins[JOY] & JOY_LEFT_PIN[JOY]) == JOY_LEFT_PIN[JOY]) && (ret == (int32_t)JOY_NONE))
      {
        /* Read status of JOY_LEFT */
        status = BSP_IO_ReadPin(0, JOY_LEFT_PIN[JOY]);
        if (status >= 0)
        {
          ret = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_LEFT : (int32_t)JOY_NONE;
        }
        else
        {
          ret = status;
        }
      }
      if (((CurrentJoyPins[JOY] & JOY_RIGHT_PIN[JOY]) == JOY_RIGHT_PIN[JOY]) && (ret == (int32_t)JOY_NONE))
      {
    /* Read status of JOY_RIGHT */
    status = BSP_IO_ReadPin(0, JOY_RIGHT_PIN[JOY]);
    if (status >= 0)
    {
      ret = (status == (int32_t)IO_PIN_RESET) ? (int32_t)JOY_RIGHT : (int32_t)JOY_NONE;
    }
    else
    {
      ret = status;
    }
  }
  }
  return ret;
}

/**
  * @brief  This function handles EXTI_LINE_0 interrupt request.
  * @retval None
  */
void BSP_JOY_IRQHandler(void)
{
  HAL_EXTI_IRQHandler(&hjoy_exti[JOY1]);
}

/**
  * @brief  BSP Joystick Callback.
  * @param  JOY Joystick instance
  * @param  JoyPin Specifies the pin connected EXTI line
  * @retval None.
  */
__weak void BSP_JOY_Callback(JOY_TypeDef JOY, JOYPin_TypeDef JoyPin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(JOY);
  UNUSED(JoyPin);

  /* This function should be implemented by the user application.
     It is called into this driver when an event on JoyPin is triggered. */
}
#endif /* USE_BSP_JOY_FEATURE */
#endif /* USE_BSP_IO_CLASS */

/**
  * @}
  */ 

/** @defgroup STM32G474E-EVAL_Private_Functions Private Functions
  * @{
  */ 
/*******************************************************************************
                            Static Functions
*******************************************************************************/
#if (USE_BSP_IO_CLASS > 0)
#if (USE_BSP_JOY_FEATURE > 0)
/**
  * @brief  Joystick EXTI line detection callbacks.
  * @retval None
  */
static void JOY1_EXTI_Callback(void)
{
  if ((CurrentJoyPins[JOY1] & JOY_SEL_PIN[JOY1]) == JOY_SEL_PIN[JOY1])
  {
    /* Read IT status of JOY_SEL */
    if (BSP_IO_GetIT(0, JOY_SEL_PIN[JOY1]) == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_SEL);
      /* Clear IT status of JOY_SEL */
      (void)BSP_IO_ClearIT(0, JOY_SEL_PIN[JOY1]);
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_UP_PIN[JOY1]) == JOY_UP_PIN[JOY1])
  {
    /* Read IT status of JOY_UP */
    if (BSP_IO_GetIT(0, JOY_UP_PIN[JOY1]) == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_UP);
      /* Clear IT status of JOY_UP */
      (void)BSP_IO_ClearIT(0, JOY_UP_PIN[JOY1]);
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_DOWN_PIN[JOY1]) == JOY_DOWN_PIN[JOY1])
  {
    /* Read IT status of JOY_DOWN */
    if (BSP_IO_GetIT(0, JOY_DOWN_PIN[JOY1]) == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_DOWN);
      /* Clear IT status of JOY_DOWN */
      (void)BSP_IO_ClearIT(0, JOY_DOWN_PIN[JOY1]);
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_LEFT_PIN[JOY1]) == JOY_LEFT_PIN[JOY1])
  {
    /* Read IT status of JOY_LEFT */
    if (BSP_IO_GetIT(0, JOY_LEFT_PIN[JOY1]) == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_LEFT);
      /* Clear IT status of JOY_LEFT */
      (void)BSP_IO_ClearIT(0, JOY_LEFT_PIN[JOY1]);
    }
  }
  if ((CurrentJoyPins[JOY1] & JOY_RIGHT_PIN[JOY1]) == JOY_RIGHT_PIN[JOY1])
  {
    /* Read IT status of JOY_RIGHT */
    if (BSP_IO_GetIT(0, JOY_RIGHT_PIN[JOY1]) == (int32_t)IO_PIN_IT_SET)
    {
      BSP_JOY_Callback(JOY1, JOY_RIGHT);
      /* Clear IT status of JOY_RIGHT */
      (void)BSP_IO_ClearIT(0, JOY_RIGHT_PIN[JOY1]);
    }
  }
}
#endif /* USE_BSP_JOY_FEATURE */
#endif /* USE_BSP_IO_CLASS */

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Initializes USART1 MSP.
  * @param  huart UART handle
  * @retval None
  */
static void USART1_MspInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  /* Enable GPIO clock */
  COM1_TX_GPIO_CLK_ENABLE();
  COM1_RX_GPIO_CLK_ENABLE();

  /* Enable USART clock */
  COM1_CLK_ENABLE();

  /* Configure USART Tx as alternate function */
  gpio_init_structure.Pin = COM1_TX_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
  gpio_init_structure.Pull = GPIO_PULLUP;
  gpio_init_structure.Alternate = COM1_TX_AF;
  HAL_GPIO_Init(COM1_TX_GPIO_PORT, &gpio_init_structure);

