STMicroelectronics/STM32CubeG4/Drivers/BSP/STM32G474E-EVAL/stm32g474e_eval.c
  /* Configure USART Rx as alternate function */
  gpio_init_structure.Pin = COM1_RX_PIN;
  gpio_init_structure.Mode = GPIO_MODE_AF_PP;
  gpio_init_structure.Alternate = COM1_RX_AF;
  HAL_GPIO_Init(COM1_RX_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief  Initialize USART1 Msp part
  * @param  huart UART handle
  * @retval None
  */
static void USART1_MspDeInit(UART_HandleTypeDef *huart)
{
  GPIO_InitTypeDef          gpio_init_structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(huart);

  /* COM GPIO pin configuration */
  gpio_init_structure.Pin  = COM1_TX_PIN;
  HAL_GPIO_DeInit(COM1_TX_GPIO_PORT, gpio_init_structure.Pin);

  gpio_init_structure.Pin  = COM1_RX_PIN;
  HAL_GPIO_DeInit(COM1_RX_GPIO_PORT, gpio_init_structure.Pin);

  /* Disable USART clock */
  COM1_CLK_DISABLE();
}
#endif /* #if USE_BSP_COM_FEATURE */

#if (USE_BSP_POT_FEATURE > 0)
/**
  * @brief  Initialize POT1 Msp part
  * @param  hadc ADC handle
  * @retval None
  */
static void ADC5_MspInit(ADC_HandleTypeDef *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  /* ADC5 clock enable */
  POT1_CLK_ENABLE();
}

/**
  * @brief  De-Initialize POT1 Msp part
  * @param  hadc ADC handle
  * @retval None
  */
static void ADC5_MspDeInit(ADC_HandleTypeDef *hadc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hadc);

  /* Disable ADC clock */
  POT1_CLK_DISABLE();
}

#if (USE_BSP_POT_COMP_FEATURE > 0)
/**
  * @brief  Initialize POT1 Msp part
  * @param  hcomp COMP handle
  * @retval None
  */
static void COMP6_MspInit(COMP_HandleTypeDef *hcomp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcomp);

  /* Comp6 clock enable */
  POT1_GPIO_CLK_ENABLE();

  GPIO_InitTypeDef  gpio_init_structure;

  /* Comp6 Channel GPIO pin configuration */
  gpio_init_structure.Pin  = POT1_VINP_GPIO_PIN;
  gpio_init_structure.Mode = GPIO_MODE_ANALOG;
  gpio_init_structure.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(POT1_VINP_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin       = POT1_OUT_GPIO_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_AF_OD;
  gpio_init_structure.Alternate = GPIO_AF7_COMP6;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  HAL_GPIO_Init(POT1_OUT_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief  De-Initialize POT1 Msp part
  * @param  hcomp COMP handle
  * @retval None
  */
static void COMP6_MspDeInit(COMP_HandleTypeDef *hcomp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcomp);

  GPIO_InitTypeDef  gpio_init_structure;

  /* POT GPIO pin configuration */
  /* do not deconfig POT1_VINP_GPIO_PORT as used by OPAMP4 */

  gpio_init_structure.Pin  = POT1_OUT_GPIO_PIN;
  HAL_GPIO_DeInit(POT1_OUT_GPIO_PORT, gpio_init_structure.Pin);
}
#endif /* (USE_BSP_POT_COMP_FEATURE > 0) */

/**
  * @brief  Initialize POT1 Msp part
  * @param  hopamp OPAMP handle
  * @retval None
  */
static void OPAMP4_MspInit(OPAMP_HandleTypeDef *hopamp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hopamp);

  /* OpAmp4 clock enable */
  POT1_GPIO_CLK_ENABLE();

  GPIO_InitTypeDef  gpio_init_structure;

  /* OpAmp4 Channel GPIO pin configuration : analog by default */
  gpio_init_structure.Pin  = POT1_INM_GPIO_PIN;
  gpio_init_structure.Mode = GPIO_MODE_ANALOG;
  gpio_init_structure.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(POT1_INM_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin  = POT1_VINP_GPIO_PIN;
  gpio_init_structure.Mode = GPIO_MODE_ANALOG;
  gpio_init_structure.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(POT1_VINP_GPIO_PORT, &gpio_init_structure);

  gpio_init_structure.Pin       = POT1_VOUT_GPIO_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_ANALOG;
  gpio_init_structure.Pull      = GPIO_NOPULL;
  HAL_GPIO_Init(POT1_VOUT_GPIO_PORT, &gpio_init_structure);
}

/**
  * @brief  De-Initialize POT1 Msp part
  * @param  hopamp OPAMP handle
  * @retval None
  */
static void OPAMP4_MspDeInit(OPAMP_HandleTypeDef *hopamp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hopamp);

  GPIO_InitTypeDef  gpio_init_structure;

  /* POT GPIO pin configuration */
  gpio_init_structure.Pin  = POT1_VOUT_GPIO_PIN;
  HAL_GPIO_DeInit(POT1_VOUT_GPIO_PORT, gpio_init_structure.Pin);
  /* do not deconfig POT1_VINP_GPIO_PORT as used by COMP6 */
  gpio_init_structure.Pin  = POT1_INM_GPIO_PIN;
  HAL_GPIO_DeInit(POT1_INM_GPIO_PORT, gpio_init_structure.Pin);
}

#endif /*(USE_BSP_POT_FEATURE > 0)*/
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
